# Assignment on Store_sales dataset

**Load the Dataset**

In [4]:
import pandas as pd
import numpy as np
df=pd.read_csv("C:\\college\\COE\\store_sales.csv")
df

,store_id,city,Jan,Feb,Mar,Apr,May,Jun,July,Aug,Sep,Oct,Nov,Dec
0,S_1,Texas,8,20,13,21,17,20,24,17,16,9,7,6
1,S_2,California,12,19,15,15,11,19,7,15,10,11,21,19
2,S_3,California,16,16,14,19,23,6,13,13,15,14,24,8
3,S_4,Texas,8,18,13,10,14,14,6,8,8,18,7,11
4,S_5,Texas,19,5,24,9,5,24,10,5,24,15,6,13
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
95,S_96,Texas,7,10,20,20,10,15,15,21,15,7,23,22
96,S_97,California,13,6,7,15,22,10,21,23,10,6,12,9
97,S_98,Texas,16,9,6,14,20,13,11,10,8,22,17,22
98,S_99,Arizona,18,16,9,5,12,22,11,13,21,17,19,10
99,S_100,California,5,23,17,24,15,21,19,10,12,20,5,9

**Calculate the total sales for each store across all months.**

In [16]:
df['total_sales']=df.iloc[:,2:].sum(axis=1)
print(df[['store_id','total_sales']])

   store_id  total_sales
0       S_1       1424.0
1       S_2       1392.0
2       S_3       1448.0
3       S_4       1080.0
4       S_5       1272.0
..      ...          ...
95     S_96       1480.0
96     S_97       1232.0
97     S_98       1344.0
98     S_99       1384.0
99    S_100       1440.0

[100 rows x 2 columns]

**Find the average sales for each month across all stores

In [61]:
df['avg_sales']=df.iloc[:,2:].mean(axis=0)
print(avg_sales)

Jan              14.46
Feb              15.09
Mar              14.56
Apr              14.57
May              13.56
Jun              13.80
July             14.38
Aug              15.81
Sep              14.91
Oct              14.10
Nov              15.31
Dec              13.57
total_sales    1392.96
avg_sales          NaN
dtype: float64

**Identify the store with the highest total sales.**

In [59]:
highest_sale=df.loc[df['total_sales'].idxmax(),'store_id']
print(highest_sale,"with",df['total_sales'].max(),"total sales")

,store_id,city,Jan,Feb,Mar,Apr,May,Jun,July,Aug,Sep,Oct,Nov,Dec,total_sales,avg_sales,month_avg_sales
61,S_62,California,16,21,6,22,22,9,21,21,22,17,16,21,1712.0,NaN,NaN
85,S_86,California,15,23,24,18,21,17,23,13,12,11,24,13,1712.0,NaN,NaN

**Calculate the total sales for each city.**

In [38]:
city_sales = df.groupby('city').sum(numeric_only=True).sum(axis=1)
print(city_sales)

city
Arizona       35559.0
California    67698.0
Texas         53451.0
dtype: float64

**List stores with total sales greater than 200**

In [43]:
stores_g200=df.loc[df['total_sales']>200,'store_id']
print(stores_g200)

0       S_1
1       S_2
2       S_3
3       S_4
4       S_5
      ...
95     S_96
96     S_97
97     S_98
98     S_99
99    S_100
Name: store_id, Length: 100, dtype: object

**Which month had the highest average sales across all stores?**

In [71]:
month_avg_sales=df.loc[:, 'Jan':'Dec'].mean(axis=0)

In [78]:
high_avg_month=month_avg_sales.idxmax()
print(high_avg_month)

total_sales

**Which city generated the most revenue?**

In [70]:
most_rev_city = df.groupby('city').sum(numeric_only=True).sum(axis=1).idxmax()
most_rev_city

'California'